Tekla.Structures.Model.UI.View.ViewProjectionType
The view projection types.
The projection type can be read but not changed.

Tekla.Structures.Model.UI.View.ViewProjectionType.ORTHOGONAL_PROJECTION
The orthogonal view projection type.

Tekla.Structures.Model.UI.View.ViewProjectionType.PERSPECTIVE_PROJECTION
The perspective view projection type.